Services/src/InformationRegisters/С_Валюты/С_Валюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>С_Валюты</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <dimensions>
    <name>Cur_Code</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Cur_Id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Cur_Scale</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Services/src/CommonModules/С_КлассификаторВалютСервер/Module.bsl
Процедура ПолучитьВалюты(ЗаписьТекст, КодОшибки, Отказ) Экспорт
	
	Попытка
		Прокси = WSСсылки.WSСсылкаНБРБ.СоздатьWSПрокси("http://www.nbrb.by/", "ExRates","ExRatesSoap");
		ТипПер = Прокси.ФабрикаXDTO.Пакеты.Получить("http://www.nbrb.by/").Получить("CurrenciesRef");
		Парам =  Прокси.ФабрикаXDTO.Создать(ТипПер);
		Парам.Periodicity = 0; 	
		РезультатЗапроса = Прокси.CurrenciesRef(Парам);
		Ответ = РезультатЗапроса.CurrenciesRefResult;	
		XDTO = Ответ.diffgram.NewDataSet;
		Список = XDTO.DailyCurrenciesRef;
		ВсегоЭлементов = Список.Количество();
		Для счЭл = 0 По ВсегоЭлементов-1 Цикл
			ТекЭлемент  = Список.Получить(счЭл);
			ЗаписьТекст = ЗаписьТекст + "Cur_Name="+Строка(ТекЭлемент.Cur_Name)
						+";Cur_Code=" + Строка(ТекЭлемент["Cur_Code"]) 
						+";Cur_Abbreviation="+  Строка(ТекЭлемент["Cur_Abbreviation"])
						+";Cur_DateEnd=" + ?(ТекЭлемент.свойства().получить("Cur_DateEnd") = Неопределено, "1","0") + Символы.ВК;
		КонецЦикла;
	Исключение
		КодОшибки =  "CURR_CLASSIFIER_ERROR";
		Отказ = Истина;
	КонецПопытки;
		
КонецПроцедуры

Процедура ЗаполнитьДанныеПоВалюте(КодВалюты, ВнутреннийКод, Кратность, ДатаЗапроса) Экспорт
	
	Если ДатаЗапроса <= Дата('20160630') Тогда
		ДатаВалюты  = Дата('20160630');
	Иначе
		ДатаВалюты  = Дата('20160702');
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВалютыСрезПоследних.Cur_Id КАК ВнутреннийКод,
		|	ВалютыСрезПоследних.Cur_Scale КАК Кратность
		|ИЗ
		|	РегистрСведений.С_Валюты.СрезПоследних(&ДатаВалюты, Cur_Code = &КодВалюты) КАК ВалютыСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("КодВалюты", КодВалюты);
    Запрос.УстановитьПараметр("ДатаВалюты", ДатаВалюты);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если  ВыборкаДетальныеЗаписи.Следующий() ТОгда
		ВнутреннийКод  = ВыборкаДетальныеЗаписи.ВнутреннийКод;
		Кратность  = ВыборкаДетальныеЗаписи.Кратность;
	Иначе
		ВнутреннийКод  =  КодВалюты;
		Кратность = 1;
	КонецЕсли;
	
КонецПроцедуры
